[" False Positives :  Instances where you think you have found a defect when there isn't any are false positives. False positives are unwanted in the code review process. You should double check your defect list before submitting to avoid false positives. ", "<h2 align='center' title='These type of defects increase maintanance effort and decrease understandibility of code.'>Evolvability Defects<_h2>", "Semantic duplication :  There are two sections in the code that are not the same but they perform the same task.", "Semantic dead code : A piece of code that the program executes which does not perform any meaningful task.", "Duplication : The exact replica of this code exists in the project.", "Consistency : When something is achieveable with multiple ways or styles, you should select one of them and use only that for consistency. For example if you are naming your variables as camel case, you should not change it arbitrarily.  ", "Dead Code : A piece of code in the program which is never executed.", "Bracket : Unnecessary or inconsistent usage of brackets. ", "Indentation : Indentation of a certain code piece is not compliant with the rest of code.", "Blank line usage : Empty lines usually indicate a separation of functionality thus they are commonly founded in places where single responsibility principle is violated. ", "Long line : Unnaturally long lines of code makes programs harder to read and debug, they might also make you miss code reuse opportunities.", "Immutable : An immutable object is an object that can not be changed once its created.  ", "Void Parameter : Null never should be a parameter to an object since it does not contribute to anything. The right way is to make 2 versions of the method one with the object parameter and the second with no parameters. ", "Element Type : Suboptimal usage of element (variable) type assignments. ", "Naming : Inconsistent or irrelevant naming.", "Comments : Comments that are completely unnecessary or wrong. ", "<h2 align='center' title='These type of defects prevent the code from working correctly.' >Functional Defects<_h2>", "Function Call : Improper or unnecessary function call, we should extend this to include middle man functions or multi responsibility methods.", "Parameter : Too many or unnecessary parameters, wrong choice of parameters, perhaps even null parameters.", "Variable initialization : Unnecessary dummy initializations, maybe some variable should have been declared as final or vica versa. ", "Memory management : Very common in some languages, not so common in others. ", "Data and Resource Manipulation : This is the most general type of functional errors. If you have found a functional error that you cant assign to any other type than consider this one. Perhaps the code is going to throw a NPE. These type of errors belongs in this category.", "Compare : Any errors made while utilizing '&lt;'',”>””=” type of operators are of this type.", "Compute : These are the errors which are mathematics related rather than programming.", "Algorithm_Performance : Obvious design choices that makes the program “significantly” inefficient memory or speed wise."]